The name of the weather station at the site location.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014 UR2
 Syntax
  C#
public string WeatherStationName { get; }
  Visual Basic
Public ReadOnly Property WeatherStationName As String
	Get
  Visual C++
public:
property String^ WeatherStationName {
	String^ get ();
}
 See Also
  SiteLocation Class
  Autodesk.Revit.DB Namespace